import json

# 超参数字典
stocks = {
    'A': ['601933', '002049', '002422', '000880', '000977',
          '601100', '002244', '002299', '600839', '000963'],
    # 大市值高波动 永辉超市, 紫光国微，科伦药业, 潍柴重机， 浪潮信息，
    #           恒力液压，滨江集团，圣农发展，四川长虹，华东医药
    'B': ['000001', '601857', '601628', '000538', '600900',
          '002594', '601169', '000425', '600886', '600887'],
    # 大市值低波动 平安银行，中国石油，中国人保，云南白药, 长江电力，
    #           比亚迪，北京银行，徐工机械，国投电力,伊利

    'C': ['000863', '000678', '002553', '002561', '002724',
          '002290', '002177', '002277', '002629', '002702']
    # 小市值高波动 三湘印象, 襄阳轴承，南方精工，徐家汇，海洋王，
    #           禾盛新材，御银股份，友阿股份，仁智股份，海欣食品
}

filename = './params/stocks.json'

with open(filename, 'w') as f:
    json.dump(stocks, f, indent=4)
print(f"已保存到 {filename}")
