import json

# 超参数字典
stocks = {
    'A': ['601933', '000066', '002049', '002422', '600580',
          '002261', '600126', '000880', '600598', '600597'],
    # 大市值高波动 永辉超市, 中国长城，紫光国微，科伦药业，卧龙电驱，拓维信息，杭钢股份，潍柴重机，北大荒，光明乳业
    'B': ['601939', '601998', '601857', '601628', '600050',
          '600519', '600036', '600030', '600900', '002594'],
    # 大市值低波动 建设银行，中信银行，中国石油，中国人保，中国联通, 茅台, 招商银行, 中信证券, 长江电力，比亚迪

    'C': ['000863', '600797', '000678', '002406', '002553',
          '002570', '002561', '600354', '002165', '601008']
    # 小市值高波动 三湘印象，浙大网新，襄阳轴承，远东传动，南方精工，贝因美，徐家汇，敦煌种业，红宝丽，连云港
}

filename = './params/stocks.json'

with open(filename, 'w') as f:
    json.dump(stocks, f, indent=4)
print(f"已保存到 {filename}")
